---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.ReverseIterator
source: html/ee2becce-dc57-383c-620c-26c9f5d6c379.htm
---
# Autodesk.Revit.DB.CombinableElementArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CombinableElementArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.